Thank you for opening the issue @oc-stephen-bennett . I am unable to reproduce this across my primary region or eu-west-2 across the awscc provider version you have specified or the latest one.

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_devopsguru_resource_collection.this will be created
  + resource "awscc_devopsguru_resource_collection" "this" {
      + id                         = (known after apply)
      + resource_collection_filter = {
          + cloudformation = {
              + stack_names = [
                  + "*",
                ]
            }
          + tags           = [
              + {
                  + app_boundary_key = (known after apply)
                  + tag_values       = (known after apply)
                },
            ]
        }
      + resource_collection_type   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_devopsguru_resource_collection.this: Creating...
awscc_devopsguru_resource_collection.this: Creation complete after 6s [id=AWS_CLOUD_FORMATION]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

Though I did see a diff in the subsequent runs, it never failed. Is there anything else on the configuration that is not present in the example you have given ?